Kubernetes added and README modified
